app/channels/application_cable/connection.rb

    def verify_user(token)
      decoded_token  = decode(token)
      auth_user = User.find(decoded_token)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]