app/controllers/currents_controller.rb

  def find_a_user
    wanted_user = User.where(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]