app/controllers/favorites_controller.rb

  def top_apartment
    top_aparts = []
    fav_aparts = Favorite.pluck('house_id')
---
SELECT "favorites"."house_id" FROM "favorites"

  def create
    favorites = @current_user.favorites.build(fav_params)
    if favorites.save
---
INSERT INTO "favorites" ("user_id", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["house_id", 1], ["created_at", "2020-07-21 15:44:43.146518"], ["updated_at", "2020-07-21 15:44:43.146518"]]