app/controllers/houses_controller.rb

  def create
    houses = @current_user.houses.build(prop_params)
    if houses.save
---
INSERT INTO "houses" ("user_id", "name", "category", "description", "price", "location", "pictures", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def house_notification(house_id)
    houses = House.find_by_id(house_id)
    return unless houses.present?
    Houseupdate.create!(poster: houses.user_id, item: house_id, reader: '', read_at: '')
---
INSERT INTO "houseupdates" ("poster", "item", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["poster", 2], ["item", 13], ["created_at", "2020-07-21 16:53:51.967607"], ["updated_at", "2020-07-21 16:53:51.967607"]]