app/controllers/houseupdates_controller.rb

SELECT "houseupdates"."item" FROM "houseupdates" WHERE ("houseupdates"."reader" = $1 OR "houseupdates"."reader" IS NULL)  [["reader", 0]]
SELECT "houseupdates"."item" FROM "houseupdates" WHERE "houseupdates"."reader" = $1  [["reader", nil]]
---
  def index
    house_ids = Houseupdate.where(reader: [nil, !@current_user.id]).pluck('item')
    house_listings = []
    house_ids.each do | i |