app/controllers/sellers_controller.rb

  def index
    sel = House.pluck('user_id')
    seller = User.find(sel)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]