app/controllers/users_controller.rb

INSERT INTO "users" ("username", "country", "email", "picture", "password_digest", "created_at", "updated_at", "authentication_token", "noti_level") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    new_user = User.new(user_params)
    if new_user.save

UPDATE "users" SET "noti_level" = $1 WHERE "users"."id" = $2  [["noti_level", 2], ["id", 2]]
---
  def update
    notified = User.find(@current_user.id).update_column(:noti_level, Houseupdate.pluck('id').max)